artillery/load-test.yml
config:
  target: "{{ $processEnvironment.API_BASE_URL || 'http://localhost:5000' }}"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Warmup"
    - duration: 60
      arrivalRate: 10
      name: "Steady State Load"
    - duration: 30
      arrivalRate: 50
      name: "Peak Load Spike"
    - duration: 30
      arrivalRate: 10
      name: "Recovery/Cooldown"
  processor: "./load-test-processor.js"
  defaults:
    headers:
      User-Agent: "Artillery MongoDB Pool Load Tester"
  variables:
    baseUrl: "http://localhost:5000"
  
scenarios:
  - name: "MongoDB Pool Health Check"
    weight: 60
    flow:
      - get:
          url: "/api/health/db"
          expect:
            - statusCode: [200, 503]
      - think: 1

  - name: "General Health Check"
    weight: 20
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
      - think: 2

  - name: "Detailed Health Check"
    weight: 20
    flow:
      - get:
          url: "/api/health/detailed"
          expect:
            - statusCode: [200, 503]
      - think: 3